---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarContainerParameterManager.Dispose
source: html/37f9ed71-f3fa-9ce0-db64-aba29212386b.htm
---
# Autodesk.Revit.DB.Structure.RebarContainerParameterManager.Dispose Method

Releases all resources used by the RebarContainerParameterManager

## Syntax (C#)
```csharp
public void Dispose()
```